# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige practicum de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [2]:
import warnings

warnings.simplefilter("ignore")

import pandas as pd
import sqlite3

Zet het bestand go_sales_train.sqlite in een makkelijk te vinden map

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige practicum de code om een connectie met het bestand go_sales_train.sqlite te maken.

In [3]:
conn = sqlite3.connect("../data/go_sales_train.sqlite")

Lees van de ingelezen go_sales_train-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [4]:
product = pd.read_sql_query("SELECT * FROM product", conn)
product_type = pd.read_sql_query("SELECT * FROM product_type", conn)
product_line = pd.read_sql_query("SELECT * FROM product_line", conn)
sales_staff = pd.read_sql_query("SELECT * FROM sales_staff", conn)
sales_branch = pd.read_sql_query("SELECT * FROM sales_branch", conn)
retailer_site = pd.read_sql_query("SELECT * FROM retailer_site", conn)
country = pd.read_sql_query("SELECT * FROM country", conn)
order_header = pd.read_sql_query("SELECT * FROM order_header", conn)
order_details = pd.read_sql_query("SELECT * FROM order_details", conn)
returned_item = pd.read_sql_query("SELECT * FROM returned_item", conn)
return_reason = pd.read_sql_query("SELECT * FROM return_reason", conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt. <u>Let op:</u> lees eventueel de informatie uit het Notebook van werkcollege 1.1b nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [5]:
sql_query = "SELECT name FROM sqlite_master WHERE type='table';"
# Vul dit codeblok verder in
pd.read_sql(sql_query, conn)
# Op de puntjes hoort de connectie naar go_sales_train óf go_staff_train óf go_crm_train te staan.

             name
0         country
1   order_details
2    order_header
3    order_method
4         product
5    product_line
6    product_type
7   retailer_site
8   return_reason
9   returned_item
10   sales_branch
11    sales_staff

erachter

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [6]:
product[(product["PRODUCTION_COST"] < 100) & (product["PRODUCTION_COST"] > 50)].loc[
    :, ["PRODUCT_NUMBER", "PRODUCTION_COST"]
]

     PRODUCT_NUMBER  PRODUCTION_COST
5                 6            85.11
7                 8            75.00
16               17            60.00
17               18            86.00
19               20            78.55
22               23            65.33
23               24            62.50
45               46            52.86
47               48            55.00
57               58            57.13
68               69            73.33
69               70            80.00
70               71            60.00
71               72            72.50
74               75            80.00
77               78            79.19
78               79            92.58
79               80            94.12
82               83            56.25
83               84            78.55
109             110            60.00
110             111            81.80
113             114            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [7]:
product[(product["MARGIN"] < 0.2) | (product["MARGIN"] > 0.6)].loc[
    :, ["PRODUCT_NUMBER", "MARGIN"]
]

    PRODUCT_NUMBER  MARGIN
20              21    0.17
23              24    0.17
85              86    0.67
86              87    0.67
87              88    0.70
88              89    0.63
89              90    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [8]:
country[(country["CURRENCY_NAME"] == "francs")].loc[:, ["COUNTRY"]]

        COUNTRY
0        France
7   Switzerland
15      Belgium

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [9]:
product[(product["MARGIN"] > 0.5)].loc[:, ["INTRODUCTION_DATE"]].drop_duplicates()

    INTRODUCTION_DATE
66         2000-10-26
85         1995-02-15
101        2003-12-10
103        2003-12-18
104        2003-12-27
106        2004-01-13
110        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [10]:
sales_branch[sales_branch["ADDRESS2"].notna() & sales_branch["REGION"].notna()].loc[
    :, ["ADDRESS2", "REGION"]
]

             ADDRESS2         REGION
2       4e verdieping  Noord-Holland
13  Lomas de Santa Fe         México
14        Shinjuku-ku          Tokyo
15           Asahi-ku          Osaka
16            Level 2            VIC
18   CJ 231 2o. Andar             SP
24      Market Street  West Midlands

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [11]:
country[country["CURRENCY_NAME"].str.contains("dollar")].loc[
    :, ["COUNTRY"]
].sort_values(by="COUNTRY")

          COUNTRY
14      Australia
3          Canada
11         Taiwan
2   United States

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [12]:
retailer_site[
    retailer_site["POSTAL_ZONE"].str.startswith("D") & retailer_site["ADDRESS2"].notna()
].loc[:, ["POSTAL_ZONE", "ADDRESS2"]]

   POSTAL_ZONE       ADDRESS2
31     D-60314  3. Tür rechts
59     D-22335       4. Stock

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [13]:
product["PRODUCT_NUMBER"].count()

115

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [14]:
retailer_site[retailer_site["REGION"].notna()].loc[
    :, ["REGION"]
].drop_duplicates().count()

REGION    110
dtype: int64

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [15]:
import pandas as pd

lowest_margin = product["MARGIN"].idxmin()
highest_margin = product["MARGIN"].idxmax()
avg_margin = product["MARGIN"].mean()

margins_df = pd.DataFrame(
    {
        "Lowest Margin": [product.loc[lowest_margin, "MARGIN"]],
        "Highest Margin": [product.loc[highest_margin, "MARGIN"]],
        "Average Margin": [round(avg_margin, 2)],
    }
)

margins_df

   Lowest Margin  Highest Margin  Average Margin
0           0.17             0.7             0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [16]:
retailer_site["ADDRESS2"].isna().sum()

286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [17]:
order_details[order_details["UNIT_SALE_PRICE"] < order_details["UNIT_PRICE"]].loc[
    :, ["UNIT_COST"]
].mean()

UNIT_COST    127.340879
dtype: float64

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [18]:
sales_staff.groupby("POSITION_EN")["SALES_STAFF_CODE"].count()

POSITION_EN
Branch Manager                  19
District Manager                 4
General Manager                  1
Level 1 Sales Representative    13
Level 2 Sales Representative    39
Level 3 Sales Representative    24
Regional Manager                 2
Name: SALES_STAFF_CODE, dtype: int64

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [19]:
sales_staff.groupby("WORK_PHONE").size().loc[lambda x: x > 4]

WORK_PHONE
+(44) 121 3505267      5
+(61) 03 2982  4242    5
+31 (0)20 692 93 94    5
+33 1 68 94 52 20      5
1 (206) 292-0012       5
1 (305) 557-4810       6
1 (310) 281-5722       5
1 (403) 232-5986       5
1 (416) 493-5595       5
1 (617) 268-6754       6
dtype: int64

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [20]:
merged = retailer_site.merge(country, on="COUNTRY_CODE")
merged[merged["COUNTRY"] == "Netherlands"].loc[:, ["ADDRESS1", "CITY"]]

                      ADDRESS1          CITY
240                   Beets 36         Beets
241               Perestraat 1      Deventer
242  Laan van Meerdervoort 966      Den Haag
243             Kalfjeslaan 47    Amstelveen
244               Startbaan 11    Amstelveen
245      Noorderspoorsingel 28     Groningen
246              Hogehilweg 13     Amsterdam
247             Spoorstraat 43    Varsseveld
248             Westhavenweg 8     Amsterdam
249              Westzeedijk 4        Muiden
250            Gooiergracht 91         Laren
251            Hoofdstraat 150   Pieterburen
252                Olde Diek 2         Laren
253     Amsterdamsestraatweg 8      Maarssen
254        Krayenhoffstraat 11     Amsterdam
255         Overschiestraat 19     Amsterdam
256              Havenbuurt 12        Marken
257               Duivendaal 1    Wageningen
258              Voorstraat 37  Nieuweschans
259         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [21]:
merged = product.merge(product_type, on="PRODUCT_TYPE_CODE")
merged[merged["PRODUCT_TYPE_EN"] == "Eyewear"].loc[:, ["PRODUCT_NAME"]]

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [22]:
merged = order_header.merge(sales_staff, on="SALES_STAFF_CODE").merge(
    retailer_site, on="RETAILER_SITE_CODE"
)
merged[merged["POSITION_EN"] == "Branch Manager"].drop_duplicates(subset=["ADDRESS1"])[
    ["ADDRESS1", "FIRST_NAME", "LAST_NAME"]
]

                  ADDRESS1 FIRST_NAME LAST_NAME
3185  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers 

hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [23]:
merged = (
    sales_staff[sales_staff["POSITION_EN"].str.contains("Manager")]
    .merge(order_header, on="SALES_STAFF_CODE")
    .merge(order_details, on="ORDER_NUMBER")
)
merged[["POSITION_EN", "ORDER_DATE"]]

        POSITION_EN  ORDER_DATE
0    Branch Manager  2024-09-09
1    Branch Manager  2024-09-09
2    Branch Manager  2024-09-09
3    Branch Manager  2024-09-09
4    Branch Manager  2024-09-09
..              ...         ...
140  Branch Manager  2024-01-09
141  Branch Manager  2024-01-09
142  Branch Manager  2024-01-09
143  Branch Manager  2024-01-09
144  Branch Manager  2024-01-09

[145 rows x 2 columns]

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [24]:
merged = product.merge(product_type, on="PRODUCT_TYPE_CODE").merge(
    order_details, on="PRODUCT_NUMBER"
)
merged[merged["QUANTITY"] > 750][["PRODUCT_NAME", "PRODUCT_TYPE_EN"]].drop_duplicates()

                PRODUCT_NAME    PRODUCT_TYPE_EN
5427                Star Peg              Tents
11452              Firefly 2           Lanterns
28608        BugShield Spray  Insect Repellents
28892  BugShield Lotion Lite  Insect Repellents
29430       BugShield Lotion  Insect Repellents
29442      BugShield Extreme  Insect Repellents
30741         Sun Shelter 15          Sunscreen
31164         Sun Shelter 30          Sunscreen
31775             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [25]:
merged = product.merge(order_details, on="PRODUCT_NUMBER")

filtered = merged[
    ((merged["UNIT_PRICE"] - merged["UNIT_SALE_PRICE"]) / merged["UNIT_PRICE"]) > 0.4
]
filtered[["PRODUCT_NAME"]].drop_duplicates()

                       PRODUCT_NAME
27830             BugShield Natural
28283               BugShield Spray
28694         BugShield Lotion Lite
29127              BugShield Lotion
29464             BugShield Extreme
30562                Sun Shelter 15
30929                Sun Shelter 30
34441  Hailstorm Titanium Woods Set

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [26]:
merged = returned_item.merge(return_reason, on="RETURN_REASON_CODE").merge(
    order_details, on="ORDER_DETAIL_CODE"
)

merged[(merged["RETURN_QUANTITY"] / merged["QUANTITY"] > 0.9)][
    ["RETURN_DESCRIPTION_EN"]
].drop_duplicates()

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
2   Wrong product shipped
3   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [27]:
merged = product_type.merge(product, on="PRODUCT_TYPE_CODE")

merged.groupby("PRODUCT_TYPE_EN").count()[["PRODUCT_NUMBER"]]

                      PRODUCT_NUMBER
PRODUCT_TYPE_EN
Binoculars                         4
Climbing Accessories               7
Cooking Gear                      10
Eyewear                            5
First Aid                          5
Golf Accessories                   4
Insect Repellents                  5
Irons                              4
Knives                             5
Lanterns                          12
Navigation                         4
Packs                              6
Putters                            3
Rope                               4
Safety                             4
Sleeping Bags                      7
Sunscreen                          5
Tents                              6
Tools                              6
Watches                            5
Woods                              4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [28]:
merged = country.merge(retailer_site, on="COUNTRY_CODE")

merged.groupby("COUNTRY").count()[["RETAILER_SITE_CODE"]]

                RETAILER_SITE_CODE
COUNTRY
Australia                       10
Austria                         10
Belgium                         10
Brazil                           1
Canada                          31
China                           10
Denmark                          6
Finland                          5
France                          29
Germany                         32
Italy                           12
Japan                           25
Korea                           10
Mexico                          10
Netherlands                     20
Spain                            9
Sweden                          12
Switzerland                     13
Taiwan                          10
United Kingdom                  25
United States                  101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (4 kolommen, 10 rijen)

In [29]:
merged = product.merge(product_type, on="PRODUCT_TYPE_CODE").merge(
    order_details, on="PRODUCT_NUMBER"
)

merged[merged["PRODUCT_TYPE_EN"] == "Cooking Gear"].groupby("PRODUCT_NAME").agg(
    total_quantity=("QUANTITY", "sum"), avg_unit_sale_price=("UNIT_SALE_PRICE", "mean")
).sort_values(by="total_quantity")

                           total_quantity  avg_unit_sale_price
PRODUCT_NAME
TrailChef Deluxe Cook Set            3110           121.217638
TrailChef Single Flame               8504            63.827622
TrailChef Kettle                     8826            12.201235
TrailChef Cook Set                  10878            51.687926
TrailChef Double Flame              12476           132.672882
TrailChef Utensils                  13776            17.294151
TrailChef Kitchen Kit               22206            22.345975
TrailChef Canteen                   26544            11.979418
TrailChef Cup                       27418             6.976490
TrailChef Water Bag                 36738             6.032506

Geef een overzicht met daarin per stad waarin een verkoopafdeling is gevestigd het bijbehorende land en het aantal klanten dat zich bevindt in die stad. Noem de kolom met steden ‘verkoper’ en de kolom met het aantal klanten 'klanten' (3 kolommen, 29 rijen)

In [30]:
merged = (
    retailer_site.merge(country, on="COUNTRY_CODE")
)

merged.groupby("CITY").agg(
    verkoper=('COUNTRY', 'first'),
    klanten=("RETAILER_SITE_CODE", "count"),
)[['verkoper', 'klanten']]

                  verkoper  klanten
CITY
Aarhus             Denmark        1
Albany       United States        1
Albuquerque  United States        1
Alexandria   United States        1
Amstelveen     Netherlands        2
...                    ...      ...
Wugu Shiang         Taiwan        1
Zaragoza             Spain        1
Zaventem           Belgium        1
Zhengzhou            China        1
Zürich         Switzerland        3

[233 rows x 2 columns]

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [31]:
from datetime import date

date.today().year

2025

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [32]:
from datetime import datetime

date_str = "16-8-2013"
date_format = "%d-%m-%Y"
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 25 jaar in dienst) of een ‘lang in dienst’ (groter gelijk dan 12 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

## Van Jupyter Notebook naar Pythonproject

1. Richt de map waarin jullie tot nu toe hebben gewerkt in volgens de mappenstructuur uit de slides.
2. Maak van de ontstane mappenstructuur een Pythonproject dat uitvoerbaar is vanuit de terminal. Maak daarin een .py-bestand dat minstens 5 antwoorden uit dit notebook (in de vorm van een DataFrame) exporteert naar Excelbestanden. Alle notebooks mogen als notebook blijven bestaan.
3. Zorg ervoor dat dit Pythonproject zijn eigen repo heeft op Github. Let op: je virtual environment moet <b><u>niet</u></b> meegaan naar Github.

Je mag tijdens dit proces je uit stap 1 ontstane mappenstructuur aanpassen, zolang je bij het beoordelingsmoment kan verantwoorden wat de motivatie hierachter is. De slides verplichten je dus nergens toe.